src/BusinessProcesses/КонтрольПодключений/КонтрольПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>КонтрольПодключений</name>
  <task>Task.ЗадачаОтветственному</task>
  <attributes>
    <name>ОтветственныйЗаВыполнение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:BusinessProcess>

src/InformationRegisters/ПараметрыИнформационныхБаз/ПараметрыИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыИнформационныхБаз</name>
  <resources>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </resources>
  <resources>
    <name>ИмяБазыВКластере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧислоПользователей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогЖурналРегистрации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерверБазыДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипСУБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазрешитьВыдачуЛицензийСервером1СПредприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БлокировкаНачалаСеансовВключена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БлокировкаНачалаСеансовНачало</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>БлокировкаНачалаСеансовКонец</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>БлокировкаРегламентныхЗаданийВключена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешнееУправлениеСеансами</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбязательноеИспользованиеВнешнегоУправления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РасширенныеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПараметрыКластеров/ПараметрыКластеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКластеров</name>
  <resources>
    <name>ТипПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресСервераАдминистрирования</name>
    <comment>// Только для &quot;RAS&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортСервераАдминистрирования</name>
    <comment>// Только для &quot;RAS&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогЗапускаСервераАдминистрирования</name>
    <comment>// Только для &quot;RAС&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортАгентаКластера</name>
    <comment>ПортАгентаСервера Только для &quot;COM&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КластерОбъектаКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортКластера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </resources>
  <resources>
    <name>ИмяКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПерезапускаРабочихПроцессов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйОбъемПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалДопустимогоПревышенияОбъемаПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоеОтклонениеОшибокСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПринудительноЗавершатьПроблемныеПроцессы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыключенныеПроцессыОстанавливатьЧерез</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньОтказоустойчивости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РежимРаспределенияНагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мониторинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиКонтрольПодключений/НастройкиКонтрольПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПодключений</name>
  <resources>
    <name>МаксимальнаяДатаПрочитанныхЗаписейСкрыто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>МеханизмПроверкиОбрабатыватьИзменения</name>
    <type>
      <types>EnumRef.МеханизмыПроверкиПодключения</types>
    </type>
  </resources>
  <resources>
    <name>URLОпубликованнойИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьЛогинПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПарольПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПроверятьПоЖурналуРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Таймаут</name>
    <comment>Максимальное время выполнения контрольной процедуры</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЛожныеТревогиКонтрольПодключений/ЛожныеТревогиКонтрольПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛожныеТревогиКонтрольПодключений</name>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗаписиОПодключениях/ЗаписиОПодключениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаписиОПодключениях</name>
  <resources>
    <name>Приложение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатистикаБуфер/СтатистикаБуфер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаБуфер</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/МеханизмыПроверкиПодключения/МеханизмыПроверкиПодключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МеханизмыПроверкиПодключения</name>
  <enumValues>
    <name>COMСоединитель</name>
  </enumValues>
  <enumValues>
    <name>WEBСервис</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ТипыЗадачКонтрольПодключений/ТипыЗадачКонтрольПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЗадачКонтрольПодключений</name>
  <predefined>
    <items>
      <name>КонтрольПодключенийНевозможноПодключиться</name>
      <description>Восстановить возможность подключения к информационной базе</description>
    </items>
    <items>
      <name>ЛожнаяТревога</name>
      <description>Выяснить причину ложной тревоги</description>
    </items>
    <items>
      <name>КонтрольПодключенийТаймаут</name>
      <description>Не удалось подключиться за указанное время</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещатьПриКаждомИнциденте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПериодОповещенияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПриВыполнении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПредупреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйТекстПредупреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПервойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПовторнойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/BusinessProcesses/КонтрольПодключений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Общие настройки
Перем ТекстОшибки;
Перем ЗадачаОшибкаПриАнализе;
Перем ОбязательныеНастройки;
Перем НетПроблем;
Перем ИмяСтраницыСправки;

// Настройки контрольной процедуры
Перем МаксимальнаяДатаПрочитанныхЗаписейСкрыто;
Перем КаталогЖурналРегистрации;
Перем МеханизмПроверки;
Перем ЛогинПриПодключении;
Перем ПарольПриПодключении;
Перем НеВыполнятьКонтрольныеПодключения;
Перем СтрокаСоединения;
Перем URLОпубликованнойИнформационнойБазы;
Перем Кластер;
Перем ВерсияПлатформы;
Перем НеПроверятьПоЖурналуРегистрации;

//////////////////////
// Общие функции
//////////////////////



Процедура ПроверкаНаНаличиеОшибокВыполнения(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ТекстОшибки <> Неопределено;
КонецПроцедуры

Процедура КонтрольнаяПроцедураЗавершенаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = НЕ КонтрольнаяПроцедура.Выполнять;
КонецПроцедуры

//////////////////
// Разбор Настроек
//////////////////

Процедура ЕстьНезаполненныеНастройкиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Ошибки = Новый Массив;
	Для Каждого Настройка Из ОбязательныеНастройки Цикл		
		Если НЕ ЗначениеЗаполнено(Настройка.Значение) Тогда
			Ошибки.Добавить(Настройка.Ключ);
		КонецЕсли;
	КонецЦикла;	
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = "Для контролируемой информационной базы требуется указать следующие настройки: "; 	
		ТекстОшибки = ТекстОшибки + Символы.ПС + " - " + ОбщийКлиентСервер.ОбъединитьСтроку(Ошибки, Символы.ПС + " - ");
		Результат = Истина;
		ИмяСтраницыСправки = "НеЗаполненыНастройкиВОбъектеКонтроля";
		
	Иначе	
		Результат = Ложь;
	КонецЕсли;
		
КонецПроцедуры

Процедура РазобратьНастройкиОбработка(ТочкаМаршрутаБизнесПроцесса)
	ТекстОшибки = Неопределено;
	Попытка
		РазобратьНастройки();
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСтраницыСправки = "НеизвестнаяОшибка";
		Отладка.Ошибка(ТекстОшибки);
		
	КонецПопытки;
КонецПроцедуры

Процедура РазобратьНастройки()
	ОбязательныеНастройки = Новый Соответствие;
	
	// Чтение настроек объекта контроля
	НастройкиОбъектаСловарь = РегистрыСведений.ПараметрыИнформационныхБаз.Получить(
		Новый Структура("ОбъектКонтроля", КонтрольнаяПроцедура.ОбъектКонтроля)
	);
	КаталогЖурналРегистрации = НастройкиОбъектаСловарь.КаталогЖурналРегистрации;
	ОбязательныеНастройки.Вставить("Каталог журнал регистрации", КаталогЖурналРегистрации);
	
	Кластер = НастройкиОбъектаСловарь.Кластер;
	ОбязательныеНастройки.Вставить("кластер 1с информационной базы", Кластер);
	
	Если ЗначениеЗаполнено(Кластер) Тогда
		НастройкиКластераСловарь = РегистрыСведений.ПараметрыКластеров.Получить(
		Новый Структура("ОбъектКонтроля", Кластер)
	);
		ВерсияПлатформы = НастройкиКластераСловарь.ВерсияПлатформы;
		ОбязательныеНастройки.Вставить("версия платформы кластера 1С", ВерсияПлатформы);
		
	КонецЕсли;
	
	// Чтение настроек
	НастройкиСловарь = РегистрыСведений.НастройкиКонтрольПодключений.Получить(
		Новый Структура("КонтрольнаяПроцедура", КонтрольнаяПроцедура)
	);
	НеПроверятьПоЖурналуРегистрации = НастройкиСловарь.НеПроверятьПоЖурналуРегистрации;
	МаксимальнаяДатаПрочитанныхЗаписейСкрыто = НастройкиСловарь.МаксимальнаяДатаПрочитанныхЗаписейСкрыто;
	МеханизмПроверки = НастройкиСловарь.МеханизмПроверкиОбрабатыватьИзменения;	
	НеВыполнятьКонтрольныеПодключения = Константы.ВыполнятьКонтрольныеПодключенияВнешнимиСредствами.Получить();
		
	Если МеханизмПроверки = Перечисления.МеханизмыПроверкиПодключения.WEBСервис Тогда
		
		URLОпубликованнойИнформационнойБазы = СокрЛП(НастройкиСловарь.URLОпубликованнойИнформационнойБазы);
		ЛогинПриПодключении = СокрЛП(НастройкиСловарь.ЛогинПриПодключении);
		ПарольПриПодключении = СокрЛП(НастройкиСловарь.ПарольПриПодключении);
		
	Иначе
		
		СтрокаСоединения = СокрЛП(НастройкиСловарь.СтрокаСоединения);
	
	КонецЕсли;
	
	
КонецПроцедуры


/////////////////////
// Формирование задач
/////////////////////

Функция СоздатьЗадачуОтветственномуЗаВыполнение(ТекстПоручения)

	Возврат Неопределено;
	
КонецФункции	

Процедура СформироватьСписокЗадач(ФормируемыеЗадачи, ЗадачаСсылка, ТочкаМаршрутаБизнесПроцесса)
	ФормируемыеЗадачи.Очистить();		
	
	ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
	Если ЗадачаОбъект.БизнесПроцесс = Неопределено И ЗадачаОбъект.ТочкаМаршрута = Неопределено Тогда 
		БизнесПроцессСервер.ПривязатьЗадачуКТочкеМаршрута(ЭтотОбъект.Ссылка, ЗадачаОбъект, ТочкаМаршрутаБизнесПроцесса);	
	КонецЕсли;
	ЗадачаОбъект.Выполнена = Ложь;
	ФормируемыеЗадачи.Добавить(ЗадачаОбъект);
	
КонецПроцедуры	

Процедура УстранитьПричиныНевозможностиАнализаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗадачаОшибкаПриАнализе = СоздатьЗадачуОтветственномуЗаВыполнение(ТекстОшибки);
	СформироватьСписокЗадач(ФормируемыеЗадачи, ЗадачаОшибкаПриАнализе, ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура НачатьПроверкуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//здесь надо переиспользовать задачу
	ЗадачаПоПерезапуску = БизнесПроцессСервер.НайтиЗадачуПерезапуска(ЭтотОбъект.Ссылка);
	СформироватьСписокЗадач(ФормируемыеЗадачи, ЗадачаПоПерезапуску, ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

////////////////////////
// Анализ
////////////////////////

Процедура ВыполнитьАнализОбработка(ТочкаМаршрутаБизнесПроцесса)
	ТекстОшибки = Неопределено;
	Попытка 
		ВыполнитьАнализ();
	Исключение
		
		НетПроблем = Неопределено;
		ИмяСтраницыСправки = "НеизвестнаяОшибка";
		Сообщение = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС + "Рабочий сервер: " + ИмяКомпьютера();
		Отладка.Ошибка(Сообщение);
		СоздатьЗадачуОтветственномуЗаВыполнение(Сообщение);
		
	КонецПопытки;

КонецПроцедуры


Процедура ВыполнитьАнализ()
	
	ВыборкаЛожныхТревог = РегистрыСведений.ЛожныеТревогиКонтрольПодключений.Выбрать(
		Новый Структура("КонтрольнаяПроцедура", КонтрольнаяПроцедура)
	);
	Если ВыборкаЛожныхТревог.Следующий() Тогда
		НетПроблем = Неопределено;
		Возврат;
	КонецЕсли;
	
	НетПроблем = Истина;
	
	ЗаписиОПодключенияхНайдены = Ложь;
	ПодключениеУспешно = Истина;
	ОшибкаПодключенияТекст = "";
	Если НЕ НеВыполнятьКонтрольныеПодключения Тогда	
		
		ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Если МеханизмПроверки = Перечисления.МеханизмыПроверкиПодключения.COMСоединитель Тогда
			Попытка 
				МенеджерСоединений = Общий.ПолучитьComСоединитель(ВерсияПлатформы);
				ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
				МенеджерСоединений.Connect(СтрокаСоединения);
				
				Длительность = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала)/1000;
				ЗафиксироватьДлительностьПодключения(Длительность, Истина);
			Исключение
				Длительность = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала)/1000;
				ПодключениеУспешно = Ложь;
				ОшибкаПодключенияТекст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗафиксироватьДлительностьПодключения(Длительность, Ложь);	
			КонецПопытки;
        Иначе
            Таймаут = 30;
			URLСервиса = СформироватьАдресWebСервиса(URLОпубликованнойИнформационнойБазы);
			Попытка 
				Если ПустаяСтрока(ЛогинПриПодключении) Тогда
					Определения = Новый WSОпределения(URLСервиса,,,,Таймаут);
				Иначе
					Если ПустаяСтрока(ПарольПриПодключении) Тогда
						Определения = Новый WSОпределения(URLСервиса, ЛогинПриПодключении,,,Таймаут);
					Иначе
						Определения = Новый WSОпределения(URLСервиса, ЛогинПриПодключении, ПарольПриПодключении,,Таймаут);
					КонецЕсли;
				КонецЕсли;
				
				Прокси = Новый WSПрокси(Определения, "http://www.1c.ru/SSL/RemoteControl_1_0_0_1", "RemoteControl", "RemoteControlSoap",,Таймаут); 
				Если НЕ ПустаяСтрока(ЛогинПриПодключении) Тогда 
					Прокси.Пользователь = ЛогинПриПодключении;
					Если НЕ ПустаяСтрока(ПарольПриПодключении) Тогда
						
						Прокси.Пароль = ПарольПриПодключении;
						
					КонецЕсли;	
				КонецЕсли;
				
				ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
				Прокси.GetCurrentState();
				Длительность = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала)/1000;
				ЗафиксироватьДлительностьПодключения(Длительность, Истина);
			Исключение
				Длительность = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала)/1000;
				ПодключениеУспешно = Ложь;
				ОшибкаПодключенияТекст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС + "Рабочий сервер: " + ИмяКомпьютера();
				ЗафиксироватьДлительностьПодключения(Длительность, Ложь);
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;

	Если ПодключениеУспешно И НЕ НеПроверятьПоЖурналуРегистрации Тогда
		Фильтр = Новый Структура("ДатаНачала, Событие");
		ТекущаяДатаСервер = ТекущаяДата();
		Фильтр.ДатаНачала = ?(
			ТекущаяДатаСервер - МаксимальнаяДатаПрочитанныхЗаписейСкрыто > 600,
			ТекущаяДатаСервер - 600,
			МаксимальнаяДатаПрочитанныхЗаписейСкрыто
		);
		Фильтр.Событие = "_$Session$_.Start";
		Если ЛогинПриПодключении <> Неопределено Тогда
			Фильтр.Вставить("Пользователь", ЛогинПриПодключении);
		Иначе
			СписокКлиентов = Новый Массив;
			СписокКлиентов.Добавить("COMConnection");
			СписокКлиентов.Добавить("1CV8C");
			СписокКлиентов.Добавить("WebClient");
			СписокКлиентов.Добавить("1CV8");
			
			Фильтр.Вставить("ИмяПриложения", СписокКлиентов);
		КонецЕсли;
		ПоследняяЗаписьСДатой = Новый ТаблицаЗначений;
		
		ЧастиПутиКЖурналу = Новый Массив;
		ЧастиПутиКЖурналу.Добавить(КаталогЖурналРегистрации);
		ЧастиПутиКЖурналу.Добавить("1Cv8.lgf");
		
		ПутьКЖурналуРегистрации = ОбщийКлиентСервер.СформироватьПуть(ЧастиПутиКЖурналу);
		ВыгрузитьЖурналРегистрации(
			ПоследняяЗаписьСДатой,
			,
			,
			ПутьКЖурналуРегистрации,
			1
		);
		ЗаписиОПодключениях = Новый ТаблицаЗначений;
		ВыгрузитьЖурналРегистрации(ЗаписиОПодключениях, Фильтр, "Дата, Событие, Пользователь, ИмяПриложения", ПутьКЖурналуРегистрации);
		
		Если ПоследняяЗаписьСДатой.Количество() <> 0 Тогда
			НаборЗаписейСНастройками = РегистрыСведений.НастройкиКонтрольПодключений.СоздатьНаборЗаписей();	
			НаборЗаписейСНастройками.Отбор.КонтрольнаяПроцедура.Установить(КонтрольнаяПроцедура);
			НаборЗаписейСНастройками.Прочитать();
			НастройкиЗапись = НаборЗаписейСНастройками[0];
			НастройкиЗапись.МаксимальнаяДатаПрочитанныхЗаписейСкрыто = ПоследняяЗаписьСДатой[0].Дата;
			НаборЗаписейСНастройками.Записать();
		КонецЕсли;
		
		ЗаписиОПодключенияхНайдены = ЗаписиОПодключениях.Количество() > 0;
		
		Для Каждого СтрокаТаблицыПодключения Из ЗаписиОПодключениях Цикл
			ЗаписьОПодключении = РегистрыСведений.ЗаписиОПодключениях.СоздатьМенеджерЗаписи();
			ЗаписьОПодключении.ИнформационнаяБаза = КонтрольнаяПроцедура.ОбъектКонтроля;
			ЗаписьОПодключении.Дата = СтрокаТаблицыПодключения.Дата;
			ЗаписьОПодключении.Пользователь = СтрокаТаблицыПодключения.Пользователь;
			ЗаписьОПодключении.Приложение = СтрокаТаблицыПодключения.ИмяПриложения;
			ЗаписьОПодключении.Записать();
		КонецЦикла;
	Иначе
		ЗаписиОПодключенияхНайдены = Истина;	
	КонецЕсли;
	
	
	Если НЕ (ПодключениеУспешно И ЗаписиОПодключенияхНайдены) Тогда
		
		ТекстПредупреждения = "";
		ПодробноеПредставлениеОшибки = ?(ЗначениеЗаполнено(ОшибкаПодключенияТекст), ОшибкаПодключенияТекст, "");
		ДополнительныйТекстПредупреждения = Справочники.ТипыЗадачКонтрольПодключений.КонтрольПодключенийНевозможноПодключиться.ДополнительныйТекстПредупреждения;
		
		ДополнительныйТекстПредупреждения = БизнесПроцессСервер.УстановитьДатуВШаблоне(ДополнительныйТекстПредупреждения, "Дата=", ТекущаяДата());
		ДополнительныйТекстПредупреждения = СтрЗаменить(ДополнительныйТекстПредупреждения, "[ПодробноеПредставлениеОшибки]", ПодробноеПредставлениеОшибки);
		
		НетПроблем = Ложь;
	КонецЕсли;
	
	Параметры = Новый Массив;
	Параметры.Добавить(КонтрольнаяПроцедура.ОбъектКонтроля);
	Параметры.Добавить(?(1, НетПроблем, 0));
	ФоновыеЗадания.Выполнить(
		"КонтрольПодключенийСервер.ЗаписатьДанныеОДоступности",
		Параметры
	);
	
КонецПроцедуры

Функция СформироватьАдресWebСервиса(URLбазы)
	
	Пока Прав(URLбазы, 1) = "/" Цикл
		
		URLбазы = Лев(URLбазы, СтрДлина(URLбазы) - 1);
		
	КонецЦикла;
	
	Возврат URLбазы + "/ws/RemoteControl?wsdl"; 
	
КонецФункции

Процедура ЗафиксироватьДлительностьПодключения(ДлительностьПодключения, ПодключениеУспешно)
	
	МенеджерЗаписи = РегистрыСведений.СтатистикаБуфер.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
	МенеджерЗаписи.ГУИД = Новый УникальныйИдентификатор();
	Данные = "Контроль подключений." + КонтрольнаяПроцедура.ОбъектКонтроля + "." + "Длительность подключения" + "." + Формат(ДлительностьПодключения,"ЧРД=,; ЧН=0; ЧГ=") + ";"
	+ ?(ПодключениеУспешно, 
	"Контроль подключений." + КонтрольнаяПроцедура.ОбъектКонтроля + "." + "Успешное подключение" +  ".1",
	"Контроль подключений." + КонтрольнаяПроцедура.ОбъектКонтроля + "." + "Неуспешное подключение" +  ".1");
	МенеджерЗаписи.Данные = Данные;
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

#КонецЕсли
